bg/js/interface/mc/oceanTpl/MCStatusRes.html

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <ns1:MCStatusRes xmlns:ns1="http://mobicom.oceanbank.ru/xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:MobicomStatusResponse" ns1:version="1.0">
      <ns1:Agregator>
        <ns1:id>1</ns1:id>
      </ns1:Agregator>
      <ns1:Merchant>
        <ns1:id>1</ns1:id>
      </ns1:Merchant>
      <ns1:Owner>
        <ns1:id>GHJ45jhjg45hJHGJ</ns1:id>
      </ns1:Owner>
      <ns1:Client>
        <ns1:Phone>
          <ns1:number>9163423578</ns1:number>
          <ns1:provider>2</ns1:provider>
        </ns1:Phone>
      </ns1:Client>
      <ns1:Payment>
        <ns1:amount>2800</ns1:amount>
        <ns1:currency>643</ns1:currency>
        <ns1:result>0</ns1:result>
      </ns1:Payment>
      <ns1:Result>
        <ns1:code>0</ns1:code>
        <ns1:comment>Запрос успешно обработан</ns1:comment>
      </ns1:Result>
      <ns1:Start>
        <ns1:Result>
          <ns1:code>0</ns1:code>
          <ns1:comment>Request success</ns1:comment>
        </ns1:Result>
      </ns1:Start>
      <ns1:Reserve>
        <ns1:Result>
          <ns1:code>0</ns1:code>
          <ns1:comment>Comment SMS</ns1:comment>
        </ns1:Result>
      </ns1:Reserve>
      <ns1:Register>
        <ns1:Result>
          <ns1:code>0</ns1:code>
          <ns1:comment xsi:nil="1"></ns1:comment>
        </ns1:Result>
      </ns1:Register>
      <ns1:Transaction>
        <ns1:id>7DD493B90A4CB9757BD92CB1A60ED7E6</ns1:id>
      </ns1:Transaction>
    </ns1:MCStatusRes>
  </soap:Body>
</soap:Envelope>
